# Baseball data analysis

The data was approached by the author, who is completely ignorant in the subject of baseball, even more so in the american baseball league. Please, keep this in mind while reading through the notebook.

## Getting to know the data

In this section we start by trying to understand which data we are dealing with. We will think about how to approach the data and which conclusions we want to extract from it.

In [1]:
# We start by showing which files are at our disposal.

import os

os.listdir("baseballdatabank/")

['CollegePlaying.csv',
 'HomeGames.csv',
 'FieldingOF.csv',
 'AwardsSharePlayers.csv',
 'AllstarFull.csv',
 'readme2014.txt',
 'Parks.csv',
 'Master.csv',
 'Teams.csv',
 'Fielding.csv',
 'HallOfFame.csv',
 'Managers.csv',
 'PitchingPost.csv',
 'FieldingPost.csv',
 'AwardsShareManagers.csv',
 'AwardsManagers.csv',
 'BattingPost.csv',
 'AwardsPlayers.csv',
 'Appearances.csv',
 'Pitching.csv',
 'TeamsFranchises.csv',
 'Schools.csv',
 'ManagersHalf.csv',
 'Salaries.csv',
 'SeriesPost.csv',
 'Batting.csv',
 'TeamsHalf.csv']

## Salaries

In [2]:
# We first open the 'Salaries.csv' file and have a look what it looks like

import pandas as pd

salaries = pd.read_csv("baseballdatabank/Salaries.csv")

print len(salaries)

salaries.head()

25575

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

To understand the headers we look up what is saved in the "Salaries.csv" file in the "readme2014.txt" file, which explains all the other documents. Regarding our csv file, we find the following:

2.15 Salaries table
 
yearID         Year
teamID         Team
lgID           League
playerID       Player ID code
salary         Salary

A first question would be if the different leagues had a different evolution of the average salary over the years. Let us first see how many different leagues are saved here:

In [6]:
salaries['lgID'].unique()

array(['NL', 'AL'], dtype=object)

There are two kind of leagues, 'NL' and 'AL'. Let us group the data by year and league, and plot the mean of both leagues over the years.

In [12]:
salaries_by_league = salaries.groupby(['yearID','lgID']).mean()
salaries_by_league

              salary
yearID lgID
1985   AL     455597
       NL     500249
1986   AL     402337
       NL     433925
1987   AL     441846
       NL     427857
1988   AL     453901
       NL     452374
1989   AL     502052
       NL     511116
1990   AL     500415
       NL     525913
1991   AL     908126
       NL     879587
1992   AL    1017651
       NL    1085608
1993   AL    1028575
       NL     923882
1994   AL    1130703
       NL     971003
1995   AL    1039864
       NL     890698
1996   AL    1055235
       NL    1000406
1997   AL    1267829
       NL    1169651
1998   AL    1364396
       NL    1207658
1999   AL    1503986
       NL    1468880
...              ...
2001   AL    2333183
       NL    2232801
2002   AL    2449016
       NL    2342579
2003   AL    2524939
       NL    2614933
2004   AL    2517280
       NL    2469002
2005   AL    2681580
       NL    2590986
2006   AL    3088941
       NL    2616445
2007   AL    3304390
       NL    2623749
2008   AL    3449574
       NL    2870790
2009   AL    3380833
       NL    3184368
2010   AL    3431360
       NL    3142161
2011   AL    3505557
       NL    3156654
2012   AL    3662264
       NL    3277278
2013   AL    3757664
       NL    3688940
2014   AL    4030561
       NL    3935543
2015   AL    4387324
       NL    4212445

[62 rows x 1 columns]